Revit 2027 API
DuctSizes.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<MEPSize> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of MEPSize)
public:
virtual IEnumerator<MEPSize^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<MEPSize>
override GetEnumerator : unit -> IEnumerator<MEPSize>
Return Value
IEnumerator<MEPSize>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace